<?php

return [
    /************* Global ************/
    'global' => [
        'id' => 'ID',
        'email' => 'البريد الالكتروني',
        'phone' => 'رقم الهاتف',
        'password' => 'كلمة المرور',
        'ok' => 'موافق',
        'copyright' => 'حقوق النشر',
        'all' => 'الكل',
        'actions' => 'إجراءات',
        'created_at' => 'تاريخ الإضافة',
        'search' => 'بحث',
        'choose' => 'اختر',
        'save' => 'حفظ',
        'edit' => 'تعديل',
        'update' => 'تحديث',
        'dashboard' => 'لوحة التحكم',
        'cancel' => 'الغاء',
        'delete' => 'حذف',
    ],

    /************* Settings ************/
    'setting' => [
        'title' => 'الإعدادات',
        'general' => 'إعدادات عامة',
        'name' => 'اسم الموقع',
        'email' => 'بريد الموقع',
        'description' => 'وصف الموقع',
        'logo' => 'لوجو الموقع',
        'icon' => 'ايكون الموقع',
        'head_code' => 'إضافة أكواد لرأس الصفحة داخل وسم head',
        'footer_code' => 'إضافة أكواد لذيل الصفحة داخل وسم footer',
        'social_media' => 'وسائل التواصل الاجتماعي',
        'timezone' => 'المنطقة الزمنية',
        'code_title' => 'حقن أكواد',
        'config_email' => 'إعدادات البريد',
    ],

    /************* Admin ************/
    'admin' => [
        'title' => 'المديرين',
        'type' => 'مدير',
        'add_new' => 'إضافة مدير جديد',
        'welcome_back' => 'مرحبًا بعودتك',
        'please_login' => 'من فضلك سجل دخولك للمتابعة.',
        'remember_me' => 'تذكرنى',
        'profile' => 'حسابي',
        'update_profile' => 'تم تحديث بيانات حسابك بنجاح',

        'main' => 'مدير رئيسي',
        'name' => 'اسم المدير',
        'info' => 'معلومات عن المدير',
        'img' => 'صوة المدير',
        'role' => 'اسم مجموعة الصلاحية',
    ],

    /************* roles ************/
    'backup' => [
        'title' => 'النسخ الاحتياطي',
        'alertBackup' => 'يتم الان استعادة قاعدة البيانات <br/> الرجاء عدم اغلاق الصفحة',
        'alertDownload' => 'هل أنت متاكد من تحميل الملف؟',
        'createBackup' => 'إنشاء نسخة احتياطية',
        'file_name' => 'اسم الملف',
        'file_size' => 'حجم الملف',
        'download' => 'تحميل',
        'recovery' => 'إستعادة',
        'recoveryDB' => 'استعادة قاعدة البيانات',
        'confirm_database_restore' => 'تم استعادة قاعدة البيانات بنجاح',
        'file_not_found' => 'خطأ الملف غير موجود',
        'Backup_created_successfully' => 'تم انشاء النسخة الاحتياطية بنجاح',
        'alert_recovery' => 'هل أنت متاكد من استعادة قاعدة البيانات؟',
        'alert_delete' => 'هل أنت متاكد من حذف الملفات المحددة؟',
    ],
    /************* roles ************/
    'role' => [
        'title' => 'الصلاحيات',
        'add_new' => 'اضافة صلاحية جديدة',
        'total_use' => 'إجمالي :count مستخدمين',
        'name' => 'اسم الصلاحية',
        'full_access' => 'صلاحية كاملة',

        'edit_role' => 'تعديل الصلاحية',
        'select_all' => 'تحديد الكل',
        'show' => 'إظهار',
        'create' => 'إنشاء',
        'edit' => 'تعديل',
        'delete' => 'حذف',
        'not_edit' => 'لا يمكنك التعديل',
    ],

    /************* Auth ************/
    'auth'=> [
        'login' => 'تسجيل الدخول',

        'please_login' => 'من فضلك سجل دخولك للمتابعة.',
        'remember_me' => 'تذكرنى',

        'logout' => 'تسجيل الخروج',
        'forgot_password' => 'هل نسيت كلمة السر؟',

        'alert_not_permission' => 'ليس لديك الصلاحية لفتح هذه الصفحة',

        'password_recovery' => 'استعادة كلمة السر',
        'enter_email' => 'أدخل بريدك الإلكتروني',
        'back_login' => 'العودة إلى تسجيل الدخول',
        'send_new_password' => 'تم ارسال كلمة سر جديدة الي البريد الالكتروني',
        'new_password' => 'كلمة السر الجديدة',
    ],

    /************* Emails ************/
    'emails' => [
    ],

    /************* alert ************/
    'alert' => [

        'create_data' => 'هل أنت متاكد من اضافة البيانات؟',
        'update_data' => 'هل أنت متاكد من تحديث البيانات؟',
        'delete_data' => 'هل أنت متاكد من حذف البيانات؟',

        'error' => [
            'login_admin' => 'خطا فى بيانات الدخول',
            'main_admin_delete' => 'لا يمكن حذف هذا المدير لانه مدير رئيسي',
            'main_admin_edit' => 'لا يمكن تعديل بيانات هذا المدير لانه مدير رئيسي',
        ],
        'success' => [
            'login' => 'تم تسجيل الدخول بنجاح',
            'done_create' => 'تم اضافة البيانات بنجاح',
            'done_update' => 'تم تحديث البيانات بنجاح',
            'done_delete' => 'تم حذف البيانات بنجاح',
            'send_message' => 'تم ارسال الرسالة بنجاح',
            'done_upload_file' => 'تم رفع الأسئلة بنجاح',
        ],

    ],


];
